In [1]:
import pandas as pd

In [2]:
strings = pd.Series(['a','b','c'])
categories = pd.Series(['a','b','c'], dtype='category')
ints = pd.Series([1,2,3])
floats = pd.Series([1.2,3.4,5.6])
bools = pd.Series([True,False,True])
dates = pd.Series([pd.to_datetime('7/4/1998')])
df = pd.DataFrame({'s':strings,'f':floats})

In [3]:
strings

0    a
1    b
2    c
dtype: object

In [4]:
print(strings.dtype)

object

In [5]:
print(categories.dtype)

category

In [6]:
dates

0   1998-07-04
dtype: datetime64[ns]

In [7]:
dates[0]

Timestamp('1998-07-04 00:00:00')

In [8]:
print(df.dtypes)

s     object
f    float64
dtype: object

In [9]:
#practice

In [10]:
single_series = pd.Series(5,index=[0,1,2])
single_series

0    5
1    5
2    5
dtype: int64

In [11]:
list_series = pd.Series([1,2,3],index=['a','b','c'])
list_series

a    1
b    2
c    3
dtype: int64

In [12]:
dict_series = pd.Series({'a':1,'b':2,'c':3})
dict_series

a    1
b    2
c    3
dtype: int64

In [13]:
stock_data = pd.Series({'AAPL': 200,'MSFT': 120,'AMZN': 1800})

In [14]:
stock_data

AAPL     200
MSFT     120
AMZN    1800
dtype: int64

In [15]:
import numpy as np

In [16]:
numpy_series = pd.Series(np.array([1,2,3]))
numpy_series

0    1
1    2
2    3
dtype: int32

In [17]:
stock_data

AAPL     200
MSFT     120
AMZN    1800
dtype: int64

In [18]:
print(stock_data[0])

200

In [19]:
stock_data['AAPL']

200

In [20]:
stock_data[0:2]

AAPL    200
MSFT    120
dtype: int64

In [21]:
stock_data['AAPL':'AMZN']

AAPL     200
MSFT     120
AMZN    1800
dtype: int64

In [22]:
print(stock_data.get('MSFT'))

120

In [23]:
print(stock_data.get(1))

120

In [24]:
print(stock_data.max())
print(stock_data.min())
print(stock_data.mean())

1800
120
706.6666666666666

In [25]:
stock_data.size

3

In [26]:
stock_data.describe()

count       3.000000
mean      706.666667
std       947.698968
min       120.000000
25%       160.000000
50%       200.000000
75%      1000.000000
max      1800.000000
dtype: float64

In [27]:
stock_data

AAPL     200
MSFT     120
AMZN    1800
dtype: int64

In [28]:
stock_data[0] = 210

In [29]:
stock_data

AAPL     210
MSFT     120
AMZN    1800
dtype: int64

In [30]:
stock_data['MSFT'] = 115
stock_data

AAPL     210
MSFT     115
AMZN    1800
dtype: int64

In [31]:
second_stock_data = pd.Series({'AMD':27,'NVDA':190})

In [32]:
stock_data.append(second_stock_data)

AAPL     210
MSFT     115
AMZN    1800
AMD       27
NVDA     190
dtype: int64

In [33]:
stock_data = stock_data.append(second_stock_data)

In [34]:
stock_data

AAPL     210
MSFT     115
AMZN    1800
AMD       27
NVDA     190
dtype: int64

In [35]:
stock_data.pop('AMD')

27

In [36]:
stock_data

AAPL     210
MSFT     115
AMZN    1800
NVDA     190
dtype: int64

In [37]:
stock_data.to_list()

[210, 115, 1800, 190]

In [38]:
stock_data.to_dict()

{'AAPL': 210, 'MSFT': 115, 'AMZN': 1800, 'NVDA': 190}

In [39]:
stock_data

AAPL     210
MSFT     115
AMZN    1800
NVDA     190
dtype: int64

In [40]:
stock_data.sort_values()

MSFT     115
NVDA     190
AAPL     210
AMZN    1800
dtype: int64

In [41]:
stock_data.sort_index()

AAPL     210
AMZN    1800
MSFT     115
NVDA     190
dtype: int64

In [42]:
print(stock_data * 1.29)

AAPL     270.90
MSFT     148.35
AMZN    2322.00
NVDA     245.10
dtype: float64

In [43]:
stock_data

AAPL     210
MSFT     115
AMZN    1800
NVDA     190
dtype: int64

In [44]:
new_series = pd.Series({'AAPL':1, 'MSFT':2, 'AMZN':3, 'NVDA':4})
stock_data.add(new_series)

AAPL     211
MSFT     117
AMZN    1803
NVDA     194
dtype: int64

In [45]:
stock_dataframe = pd.DataFrame({'High':[2,2.2,2.4],'Low':[1.5,1.7,2.1],'Close':[2,2.1,2.2]})
stock_dataframe

   High  Low  Close
0   2.0  1.5    2.0
1   2.2  1.7    2.1
2   2.4  2.1    2.2

In [46]:
open_prices = pd.Series([5,5.6,5.2], index=['Jan 1','Jan 2','Jan 3'])
close_prices = pd.Series([5.2,5.7,5.4],index=['Jan 2','Jan 3','Jan 4'])

In [47]:
close_prices

Jan 2    5.2
Jan 3    5.7
Jan 4    5.4
dtype: float64

In [48]:
stock_dataframe = pd.DataFrame({'Open': open_prices,'Close': close_prices})
stock_dataframe

       Open  Close
Jan 1   5.0    NaN
Jan 2   5.6    5.2
Jan 3   5.2    5.7
Jan 4   NaN    5.4

In [49]:
apple_stock_data = pd.read_csv('AAPL.csv',
                               usecols=['Date','Open','High','Low','Close'],
                               parse_dates=True,
                               index_col='Date')
apple_stock_data
#dataframe output

                  Open        High         Low       Close
Date
2019-05-14  186.410004  189.699997  185.410004  188.660004
2019-05-15  186.270004  191.750000  186.020004  190.919998
2019-05-16  189.910004  192.470001  188.839996  190.080002
2019-05-17  186.929993  190.899994  186.759995  189.000000
2019-05-20  183.520004  184.350006  180.279999  183.089996
...                ...         ...         ...         ...
2020-05-07  303.220001  305.170013  301.970001  303.739990
2020-05-08  305.640015  310.350006  304.290009  310.130005
2020-05-11  308.100006  317.049988  307.239990  315.010010
2020-05-12  317.829987  319.690002  310.910004  311.410004
2020-05-13  312.149994  315.950012  303.209991  307.649994

[253 rows x 4 columns]

In [50]:
apple_stock_data['Close']
#Series output

Date
2019-05-14    188.660004
2019-05-15    190.919998
2019-05-16    190.080002
2019-05-17    189.000000
2019-05-20    183.089996
                 ...
2020-05-07    303.739990
2020-05-08    310.130005
2020-05-11    315.010010
2020-05-12    311.410004
2020-05-13    307.649994
Name: Close, Length: 253, dtype: float64

In [51]:
apple_stock_data.loc['2020-05-07']
#location function
#series bc it's simpler to deal with

Open     303.220001
High     305.170013
Low      301.970001
Close    303.739990
Name: 2020-05-07 00:00:00, dtype: float64

In [52]:
apple_stock_data.iloc[0:5]

                  Open        High         Low       Close
Date
2019-05-14  186.410004  189.699997  185.410004  188.660004
2019-05-15  186.270004  191.750000  186.020004  190.919998
2019-05-16  189.910004  192.470001  188.839996  190.080002
2019-05-17  186.929993  190.899994  186.759995  189.000000
2019-05-20  183.520004  184.350006  180.279999  183.089996

In [53]:
apple_stock_data['High']['2019-05-16']

192.470001

In [54]:
apple_stock_data.loc['2019-05-16']['High']
#location function needed for data indexing

192.470001

In [55]:
first_five = apple_stock_data.iloc[0:5]
#ilocation when indexing through intervals
first_five.describe()

             Open        High         Low       Close
count    5.000000    5.000000    5.000000    5.000000
mean   186.608002  189.834000  185.462000  188.350000
std      2.274647    3.234503    3.172651    3.073436
min    183.520004  184.350006  180.279999  183.089996
25%    186.270004  189.699997  185.410004  188.660004
50%    186.410004  190.899994  186.020004  189.000000
75%    186.929993  191.750000  186.759995  190.080002
max    189.910004  192.470001  188.839996  190.919998

In [56]:
first_five.max()

Open     189.910004
High     192.470001
Low      188.839996
Close    190.919998
dtype: float64

In [57]:
first_five.max(axis=0)
#based on column

Open     189.910004
High     192.470001
Low      188.839996
Close    190.919998
dtype: float64

In [58]:
first_five.max(axis=1)
#based on row

Date
2019-05-14    189.699997
2019-05-15    191.750000
2019-05-16    192.470001
2019-05-17    190.899994
2019-05-20    184.350006
dtype: float64

In [59]:
first_five.idxmax(axis=0)
#index max of columns

Open    2019-05-16
High    2019-05-16
Low     2019-05-16
Close   2019-05-15
dtype: datetime64[ns]

In [60]:
first_five.idxmax(axis=1)
#index max of rows

Date
2019-05-14    High
2019-05-15    High
2019-05-16    High
2019-05-17    High
2019-05-20    High
dtype: object

In [62]:
first_five

                  Open        High         Low       Close
Date
2019-05-14  186.410004  189.699997  185.410004  188.660004
2019-05-15  186.270004  191.750000  186.020004  190.919998
2019-05-16  189.910004  192.470001  188.839996  190.080002
2019-05-17  186.929993  190.899994  186.759995  189.000000
2019-05-20  183.520004  184.350006  180.279999  183.089996

In [84]:
first_five = apple_stock_data.iloc[0:5]
first_five

                  Open        High         Low       Close
Date
2019-05-14  186.410004  189.699997  185.410004  188.660004
2019-05-15  186.270004  191.750000  186.020004  190.919998
2019-05-16  189.910004  192.470001  188.839996  190.080002
2019-05-17  186.929993  190.899994  186.759995  189.000000
2019-05-20  183.520004  184.350006  180.279999  183.089996

In [85]:
first_five['Open'] = [1,2,3,4,5]

D:\New folder\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [86]:
first_five

            Open        High         Low       Close
Date
2019-05-14     1  189.699997  185.410004  188.660004
2019-05-15     2  191.750000  186.020004  190.919998
2019-05-16     3  192.470001  188.839996  190.080002
2019-05-17     4  190.899994  186.759995  189.000000
2019-05-20     5  184.350006  180.279999  183.089996

In [87]:
first_five.transpose()

Date   2019-05-14  2019-05-15  2019-05-16  2019-05-17  2019-05-20
Open     1.000000    2.000000    3.000000    4.000000    5.000000
High   189.699997  191.750000  192.470001  190.899994  184.350006
Low    185.410004  186.020004  188.839996  186.759995  180.279999
Close  188.660004  190.919998  190.080002  189.000000  183.089996

In [88]:
first_five * 2

            Open        High         Low       Close
Date
2019-05-14     2  379.399994  370.820008  377.320008
2019-05-15     4  383.500000  372.040008  381.839996
2019-05-16     6  384.940002  377.679992  380.160004
2019-05-17     8  381.799988  373.519990  378.000000
2019-05-20    10  368.700012  360.559998  366.179992

In [92]:
double_five = first_five * 2
double_five

            Open        High         Low       Close
Date
2019-05-14     2  379.399994  370.820008  377.320008
2019-05-15     4  383.500000  372.040008  381.839996
2019-05-16     6  384.940002  377.679992  380.160004
2019-05-17     8  381.799988  373.519990  378.000000
2019-05-20    10  368.700012  360.559998  366.179992

In [93]:
double_five.transpose()

Date   2019-05-14  2019-05-15  2019-05-16  2019-05-17  2019-05-20
Open     2.000000    4.000000    6.000000    8.000000   10.000000
High   379.399994  383.500000  384.940002  381.799988  368.700012
Low    370.820008  372.040008  377.679992  373.519990  360.559998
Close  377.320008  381.839996  380.160004  378.000000  366.179992

In [1]:
import mysql.connector

ModuleNotFoundError: No module named 'mysql'

In [4]:
import sqlite3 as sql

In [15]:
conn = sql.connect('employees.db')
c = conn.cursor()
c.execute("""CREATE TABLE employees (
first text,
last text,
pay integer
)""")

In [19]:
c.execute("INSERT INTO employees VALUES ('Mary','Schafer',70000)")

ProgrammingError: Cannot operate on a closed database.

In [18]:
c.execute("SELECT * FROM employees WHERE last='Schafer'")

ProgrammingError: Cannot operate on a closed database.

In [1]:
import mysql.connector

mydb = mysql.connector.connect(
	host = 'Localhost',
	user = 'root',
	passwd = '4V1sh44!'
	)

print(mydb)

<mysql.connector.connection.MySQLConnection object at 0x000001F629FBA908>

In [1]:
import mysql.connector

mydb = mysql.connector.connect(
	host = 'Localhost',
	user = 'root',
	passwd = '4V1sh44!'
    database = 'testdb'
	)

my_cursor = mydb.cursor()

my_cursor.execute("CREATE DATABASE testdb")

In [10]:
my_cursor.execute("SHOW DATABASES")
print(my_cursor)

MySQLCursor: SHOW DATABASES

In [11]:
for db in my_cursor:
    print(db[0])

hw4
information_schema
my_schema
my_schema2
my_schema3
mydb
mysql
performance_schema
practice2
sakila
sys
testdb
world

In [19]:
my_cursor.execute("CREATE TABLE testdb.users1 (name VARCHAR(255), email VARCHAR(255), age INT(10), user_ID INT AUTO_INCREMENT PRIMARY KEY)")
my_cursor.execute("SHOW TABLES")
for table in my_cursor:
    print(table)

ProgrammingError: 1046 (3D000): No database selected

In [1]:
import pandas as pd